OpenROAD v2.0-3879-g0b8b7ae25 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /foss/designs/SKY130_Playground/openlane/customcells/runs/germknedl/tmp/merged.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 442 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/SKY130_Playground/openlane/customcells/runs/germknedl/tmp/merged.nom.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/SKY130_Playground/openlane/customcells/runs/germknedl/results/routing/customcells.def
[INFO ODB-0128] Design: customcells
[INFO ODB-0130]     Created 4 pins.
[INFO ODB-0131]     Created 1073 components and 4240 component-terminals.
[INFO ODB-0132]     Created 4 special nets and 3992 connections.
[INFO ODB-0133]     Created 125 nets and 248 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/SKY130_Playground/openlane/customcells/runs/germknedl/results/routing/customcells.def
###############################################################################
# Created by write_sdc
# Wed Sep 14 08:54:19 2022
###############################################################################
current_design customcells
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {in}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[WARNING STA-0357] virtual clock __VIRTUAL_CLK__ can not be propagated.
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
No paths found.
min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
No paths found.
max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: in (input port clocked by __VIRTUAL_CLK__)
Endpoint: some_customcells.genblk1[1].name_of_cell/in (internal pin)
Path Group: (none)
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ in (in)
     1    0.00                           in (net)
                  0.03    0.00    2.02 ^ some_customcells.genblk1[1].name_of_cell/in (sky130_customcell)
                                  2.02   data arrival time
-----------------------------------------------------------------------------
(Path is unconstrained)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack INF

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack INF
worst_slack_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Combinational          3.93e-08   8.27e-08   1.44e-09   1.23e-07 100.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  3.93e-08   8.27e-08   1.44e-09   1.23e-07 100.0%
                          31.8%      67.0%       1.2%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 10404 u^2 98% utilization.
area_report_end
